content/man/man1/git-rev-parse.1.org
#+TITLE: Manpages - git-rev-parse.1
* NAME
git-rev-parse - Pick out and massage parameters

* SYNOPSIS
#+begin_example
git rev-parse [<options>] <arg>...
#+end_example

* DESCRIPTION
Many Git porcelainish commands take a mixture of flags (i.e. parameters
that begin with a dash /-/) and parameters meant for the underlying /git
rev-list/ command they use internally and flags and parameters for the
other commands they use downstream of /git rev-list/. The primary
purpose of this command is to allow calling programs to distinguish
between them. There are a few other operation modes that have nothing to
do with the above "help parse command line options".

Unless otherwise specified, most of the options and operation modes
require you to run this command inside a git repository or a working
tree that is under the control of a git repository, and will give you a
fatal error otherwise.

* OPTIONS
** Operation Modes
Each of these options must appear first on the command line.

--parseopt

#+begin_quote
Use /git rev-parse/ in option parsing mode (see PARSEOPT section below).
The command in this mode can be used outside a repository or a working
tree controlled by a repository.

#+end_quote

--sq-quote

#+begin_quote
Use /git rev-parse/ in shell quoting mode (see SQ-QUOTE section below).
In contrast to the *--sq* option below, this mode only does quoting.
Nothing else is done to command input. The command in this mode can be
used outside a repository or a working tree controlled by a repository.

#+end_quote

** Options for --parseopt
--keep-dashdash

#+begin_quote
Only meaningful in *--parseopt* mode. Tells the option parser to echo
out the first *--* met instead of skipping it.

#+end_quote

--stop-at-non-option

#+begin_quote
Only meaningful in *--parseopt* mode. Lets the option parser stop at the
first non-option argument. This can be used to parse sub-commands that
take options themselves.

#+end_quote

--stuck-long

#+begin_quote
Only meaningful in *--parseopt* mode. Output the options in their long
form if available, and with their arguments stuck.

#+end_quote

** Options for Filtering
--revs-only

#+begin_quote
Do not output flags and parameters not meant for /git rev-list/ command.

#+end_quote

--no-revs

#+begin_quote
Do not output flags and parameters meant for /git rev-list/ command.

#+end_quote

--flags

#+begin_quote
Do not output non-flag parameters.

#+end_quote

--no-flags

#+begin_quote
Do not output flag parameters.

#+end_quote

