public/man/man1/git-rev-parse.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - git-rev-parse.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - git-rev-parse.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>git-rev-parse - Pick out and massage parameters</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<pre class="example">
git rev-parse [&lt;options&gt;] &lt;arg&gt;...
</pre>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>Many Git porcelainish commands take a mixture of flags (i.e. parameters
that begin with a dash <em>-</em>) and parameters meant for the underlying <em>git
rev-list</em> command they use internally and flags and parameters for the
other commands they use downstream of <em>git rev-list</em>. The primary
purpose of this command is to allow calling programs to distinguish
between them. There are a few other operation modes that have nothing to
do with the above &#34;help parse command line options&#34;.</p>
<p>
Unless otherwise specified, most of the options and operation modes
require you to run this command inside a git repository or a working
tree that is under the control of a git repository, and will give you a
fatal error otherwise.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
Operation Modes
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<p>Each of these options must appear first on the command line.</p>
<p>
–parseopt</p>
<blockquote>
<p>Use <em>git rev-parse</em> in option parsing mode (see PARSEOPT section below).
The command in this mode can be used outside a repository or a working
tree controlled by a repository.</p>
</blockquote>
<p>
–sq-quote</p>
<blockquote>
<p>Use <em>git rev-parse</em> in shell quoting mode (see SQ-QUOTE section below).
In contrast to the <strong>–sq</strong> option below, this mode only does quoting.
Nothing else is done to command input. The command in this mode can be
used outside a repository or a working tree controlled by a repository.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
Options for –parseopt
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<p>–keep-dashdash</p>
<blockquote>
<p>Only meaningful in <strong>–parseopt</strong> mode. Tells the option parser to echo
out the first <strong>–</strong> met instead of skipping it.</p>
</blockquote>
<p>
–stop-at-non-option</p>
<blockquote>
<p>Only meaningful in <strong>–parseopt</strong> mode. Lets the option parser stop at the
first non-option argument. This can be used to parse sub-commands that
take options themselves.</p>
</blockquote>
<p>
–stuck-long</p>
<blockquote>
<p>Only meaningful in <strong>–parseopt</strong> mode. Output the options in their long
form if available, and with their arguments stuck.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
Options for Filtering
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<p>–revs-only</p>
<blockquote>
<p>Do not output flags and parameters not meant for <em>git rev-list</em> command.</p>
</blockquote>
<p>
–no-revs</p>
<blockquote>
<p>Do not output flags and parameters meant for <em>git rev-list</em> command.</p>
</blockquote>
<p>
–flags</p>
<blockquote>
<p>Do not output non-flag parameters.</p>
</blockquote>
<p>
–no-flags</p>
<blockquote>
<p>Do not output flag parameters.</p>
</blockquote>
</div>
</div>
