content/man/man1/git-rev-parse.1.org
** Options for Output
--default <arg>

#+begin_quote
If there is no parameter given by the user, use *<arg>* instead.

#+end_quote

--prefix <arg>

#+begin_quote
Behave as if /git rev-parse/ was invoked from the *<arg>* subdirectory
of the working tree. Any relative filenames are resolved as if they are
prefixed by *<arg>* and will be printed in that form.

This can be used to convert arguments to a command run in a subdirectory
so that they can still be used after moving to the top-level of the
repository. For example:

#+begin_quote
#+begin_example
prefix=$(git rev-parse --show-prefix)
cd "$(git rev-parse --show-toplevel)"
# rev-parse provides the -- needed for set
eval "set $(git rev-parse --sq --prefix "$prefix" -- "$@")"
#+end_example

#+end_quote

#+end_quote

--verify

#+begin_quote
Verify that exactly one parameter is provided, and that it can be turned
into a raw 20-byte SHA-1 that can be used to access the object database.
If so, emit it to the standard output; otherwise, error out.

If you want to make sure that the output actually names an object in
your object database and/or can be used as a specific type of object you
require, you can add the *^{type}* peeling operator to the parameter.
For example, *git rev-parse "$VAR^{commit}"* will make sure *$VAR* names
an existing object that is a commit-ish (i.e. a commit, or an annotated
tag that points at a commit). To make sure that *$VAR* names an existing
object of any type, *git rev-parse "$VAR^{object}"* can be used.

Note that if you are verifying a name from an untrusted source, it is
wise to use *--end-of-options* so that the name argument is not mistaken
for another option.

#+end_quote

-q, --quiet

#+begin_quote
Only meaningful in *--verify* mode. Do not output an error message if
the first argument is not a valid object name; instead exit with
non-zero status silently. SHA-1s for valid object names are printed to
stdout on success.

#+end_quote

--sq

#+begin_quote
Usually the output is made one line per flag and parameter. This option
makes output a single line, properly quoted for consumption by shell.
Useful when you expect your parameter to contain whitespaces and
newlines (e.g. when using pickaxe *-S* with /git diff-*/). In contrast
to the *--sq-quote* option, the command input is still interpreted as
usual.

#+end_quote

--short[=<length>]

#+begin_quote
Same as *--verify* but shortens the object name to a unique prefix with
at least *length* characters. The minimum length is 4, the default is
the effective value of the *core.abbrev* configuration variable (see
*git-config*(1)).

#+end_quote

--not

#+begin_quote
When showing object names, prefix them with /^/ and strip /^/ prefix
from the object names that already have one.

#+end_quote

--abbrev-ref[=(strict|loose)]

#+begin_quote
A non-ambiguous short name of the objects name. The option
core.warnAmbiguousRefs is used to select the strict abbreviation mode.

#+end_quote

--symbolic

#+begin_quote
Usually the object names are output in SHA-1 form (with possible /^/
prefix); this option makes them output in a form as close to the
original input as possible.

#+end_quote

--symbolic-full-name

#+begin_quote
This is similar to --symbolic, but it omits input that are not refs
(i.e. branch or tag names; or more explicitly disambiguating
"heads/master" form, when you want to name the "master" branch when
there is an unfortunately named tag "master"), and shows them as full
refnames (e.g. "refs/heads/master").

#+end_quote

--output-object-format=(sha1|sha256|storage)

#+begin_quote
Allow oids to be input from any object format that the current
repository supports.

#+begin_quote
#+begin_example
Specifying "sha1" translates if necessary and returns a sha1 oid.
#+end_example

#+end_quote

#+begin_quote
#+begin_example
Specifying "sha256" translates if necessary and returns a sha256 oid.
#+end_example

#+end_quote

#+begin_quote
#+begin_example
Specifying "storage" translates if necessary and returns an oid in
encoded in the storage hash algorithm.
#+end_example

#+end_quote

#+end_quote

** Options for Objects
--all

#+begin_quote
Show all refs found in *refs/*.

#+end_quote

--branches[=<pattern>], --tags[=<pattern>], --remotes[=<pattern>]

#+begin_quote
Show all branches, tags, or remote-tracking branches, respectively
(i.e., refs found in *refs/heads*, *refs/tags*, or *refs/remotes*,
respectively).

If a *pattern* is given, only refs matching the given shell glob are
shown. If the pattern does not contain a globbing character (*?*, ***,
or *[*), it is turned into a prefix match by appending */**.

#+end_quote

--glob=<pattern>

#+begin_quote
Show all refs matching the shell glob pattern *pattern*. If the pattern
does not start with *refs/*, this is automatically prepended. If the
pattern does not contain a globbing character (*?*, ***, or *[*), it is
turned into a prefix match by appending */**.

#+end_quote

--exclude=<glob-pattern>

#+begin_quote
Do not include refs matching /<glob-pattern>/ that the next *--all*,
*--branches*, *--tags*, *--remotes*, or *--glob* would otherwise
consider. Repetitions of this option accumulate exclusion patterns up to
the next *--all*, *--branches*, *--tags*, *--remotes*, or *--glob*
option (other options or arguments do not clear accumulated patterns).

The patterns given should not begin with *refs/heads*, *refs/tags*, or
*refs/remotes* when applied to *--branches*, *--tags*, or *--remotes*,
respectively, and they must begin with *refs/* when applied to *--glob*
or *--all*. If a trailing //*/ is intended, it must be given explicitly.

#+end_quote

--exclude-hidden=(fetch|receive|uploadpack)

#+begin_quote
Do not include refs that would be hidden by *git-fetch*,
*git-receive-pack* or *git-upload-pack* by consulting the appropriate
*fetch.hideRefs*, *receive.hideRefs* or *uploadpack.hideRefs*
configuration along with *transfer.hideRefs* (see *git-config*(1)). This
option affects the next pseudo-ref option *--all* or *--glob* and is
cleared after processing them.

#+end_quote

--disambiguate=<prefix>

#+begin_quote
Show every object whose name begins with the given prefix. The <prefix>
must be at least 4 hexadecimal digits long to avoid listing each and
every object in the repository by mistake.

#+end_quote

