public/man/man1/git-rev-parse.1/index.html
<div id="outline-container-headline-8" class="outline-3">
<h3 id="headline-8">
Options for Output
</h3>
<div id="outline-text-headline-8" class="outline-text-3">
<p>–default &lt;arg&gt;</p>
<blockquote>
<p>If there is no parameter given by the user, use <strong>&lt;arg&gt;</strong> instead.</p>
</blockquote>
<p>
–prefix &lt;arg&gt;</p>
<blockquote>
<p>Behave as if <em>git rev-parse</em> was invoked from the <strong>&lt;arg&gt;</strong> subdirectory
of the working tree. Any relative filenames are resolved as if they are
prefixed by <strong>&lt;arg&gt;</strong> and will be printed in that form.</p>
<p>
This can be used to convert arguments to a command run in a subdirectory
so that they can still be used after moving to the top-level of the
repository. For example:</p>
<blockquote>
<pre class="example">
prefix=$(git rev-parse --show-prefix)
cd &#34;$(git rev-parse --show-toplevel)&#34;
# rev-parse provides the -- needed for set
eval &#34;set $(git rev-parse --sq --prefix &#34;$prefix&#34; -- &#34;$@&#34;)&#34;
</pre>
</blockquote>
</blockquote>
<p>
–verify</p>
<blockquote>
<p>Verify that exactly one parameter is provided, and that it can be turned
into a raw 20-byte SHA-1 that can be used to access the object database.
If so, emit it to the standard output; otherwise, error out.</p>
<p>
If you want to make sure that the output actually names an object in
your object database and/or can be used as a specific type of object you
require, you can add the <strong><sup>type</sup></strong> peeling operator to the parameter.
For example, <strong>git rev-parse &#34;$VAR<sup>commit</sup>&#34;</strong> will make sure <strong>$VAR</strong> names
an existing object that is a commit-ish (i.e. a commit, or an annotated
tag that points at a commit). To make sure that <strong>$VAR</strong> names an existing
object of any type, <strong>git rev-parse &#34;$VAR<sup>object</sup>&#34;</strong> can be used.</p>
<p>
Note that if you are verifying a name from an untrusted source, it is
wise to use <strong>–end-of-options</strong> so that the name argument is not mistaken
for another option.</p>
</blockquote>
<p>
-q, –quiet</p>
<blockquote>
<p>Only meaningful in <strong>–verify</strong> mode. Do not output an error message if
the first argument is not a valid object name; instead exit with
non-zero status silently. SHA-1s for valid object names are printed to
stdout on success.</p>
</blockquote>
<p>
–sq</p>
<blockquote>
<p>Usually the output is made one line per flag and parameter. This option
makes output a single line, properly quoted for consumption by shell.
Useful when you expect your parameter to contain whitespaces and
newlines (e.g. when using pickaxe <strong>-S</strong> with <em>git diff-*</em>). In contrast
to the <strong>–sq-quote</strong> option, the command input is still interpreted as
usual.</p>
</blockquote>
<p>
–short[=&lt;length&gt;]</p>
<blockquote>
<p>Same as <strong>–verify</strong> but shortens the object name to a unique prefix with
at least <strong>length</strong> characters. The minimum length is 4, the default is
the effective value of the <strong>core.abbrev</strong> configuration variable (see
*git-config*(1)).</p>
</blockquote>
<p>
–not</p>
<blockquote>
<p>When showing object names, prefix them with <em>^</em> and strip <em>^</em> prefix
from the object names that already have one.</p>
</blockquote>
<p>
–abbrev-ref[=(strict|loose)]</p>
<blockquote>
<p>A non-ambiguous short name of the objects name. The option
core.warnAmbiguousRefs is used to select the strict abbreviation mode.</p>
</blockquote>
<p>
–symbolic</p>
<blockquote>
<p>Usually the object names are output in SHA-1 form (with possible <em>^</em>
prefix); this option makes them output in a form as close to the
original input as possible.</p>
</blockquote>
<p>
–symbolic-full-name</p>
<blockquote>
<p>This is similar to –symbolic, but it omits input that are not refs
(i.e. branch or tag names; or more explicitly disambiguating
&#34;heads/master&#34; form, when you want to name the &#34;master&#34; branch when
there is an unfortunately named tag &#34;master&#34;), and shows them as full
refnames (e.g. &#34;refs/heads/master&#34;).</p>
</blockquote>
<p>
–output-object-format=(sha1|sha256|storage)</p>
<blockquote>
<p>Allow oids to be input from any object format that the current
repository supports.</p>
<blockquote>
<pre class="example">
Specifying &#34;sha1&#34; translates if necessary and returns a sha1 oid.
</pre>
</blockquote>
<blockquote>
<pre class="example">
Specifying &#34;sha256&#34; translates if necessary and returns a sha256 oid.
</pre>
</blockquote>
<blockquote>
<pre class="example">
Specifying &#34;storage&#34; translates if necessary and returns an oid in
encoded in the storage hash algorithm.
</pre>
</blockquote>
</blockquote>
</div>
</div>
<div id="outline-container-headline-9" class="outline-3">
<h3 id="headline-9">
Options for Objects
</h3>
<div id="outline-text-headline-9" class="outline-text-3">
<p>–all</p>
<blockquote>
<p>Show all refs found in <strong>refs/</strong>.</p>
</blockquote>
<p>
–branches[=&lt;pattern&gt;], –tags[=&lt;pattern&gt;], –remotes[=&lt;pattern&gt;]</p>
<blockquote>
<p>Show all branches, tags, or remote-tracking branches, respectively
(i.e., refs found in <strong>refs/heads</strong>, <strong>refs/tags</strong>, or <strong>refs/remotes</strong>,
respectively).</p>
<p>
If a <strong>pattern</strong> is given, only refs matching the given shell glob are
shown. If the pattern does not contain a globbing character (<strong>?</strong>, <strong>*</strong>,
or <strong>[</strong>), it is turned into a prefix match by appending <strong>/*</strong>.</p>
</blockquote>
<p>
–glob=&lt;pattern&gt;</p>
<blockquote>
<p>Show all refs matching the shell glob pattern <strong>pattern</strong>. If the pattern
does not start with <strong>refs/</strong>, this is automatically prepended. If the
pattern does not contain a globbing character (<strong>?</strong>, <strong>*</strong>, or <strong>[</strong>), it is
turned into a prefix match by appending <strong>/*</strong>.</p>
</blockquote>
<p>
–exclude=&lt;glob-pattern&gt;</p>
<blockquote>
<p>Do not include refs matching <em>&lt;glob-pattern&gt;</em> that the next <strong>–all</strong>,
<strong>–branches</strong>, <strong>–tags</strong>, <strong>–remotes</strong>, or <strong>–glob</strong> would otherwise
consider. Repetitions of this option accumulate exclusion patterns up to
the next <strong>–all</strong>, <strong>–branches</strong>, <strong>–tags</strong>, <strong>–remotes</strong>, or <strong>–glob</strong>
option (other options or arguments do not clear accumulated patterns).</p>
<p>
The patterns given should not begin with <strong>refs/heads</strong>, <strong>refs/tags</strong>, or
<strong>refs/remotes</strong> when applied to <strong>–branches</strong>, <strong>–tags</strong>, or <strong>–remotes</strong>,
respectively, and they must begin with <strong>refs/</strong> when applied to <strong>–glob</strong>
or <strong>–all</strong>. If a trailing <em>/*</em> is intended, it must be given explicitly.</p>
</blockquote>
<p>
–exclude-hidden=(fetch|receive|uploadpack)</p>
<blockquote>
<p>Do not include refs that would be hidden by <strong>git-fetch</strong>,
<strong>git-receive-pack</strong> or <strong>git-upload-pack</strong> by consulting the appropriate
<strong>fetch.hideRefs</strong>, <strong>receive.hideRefs</strong> or <strong>uploadpack.hideRefs</strong>
configuration along with <strong>transfer.hideRefs</strong> (see <strong>git-config*(1)). This
option affects the next pseudo-ref option *–all</strong> or <strong>–glob</strong> and is
cleared after processing them.</p>
</blockquote>
<p>
–disambiguate=&lt;prefix&gt;</p>
<blockquote>
<p>Show every object whose name begins with the given prefix. The &lt;prefix&gt;
must be at least 4 hexadecimal digits long to avoid listing each and
every object in the repository by mistake.</p>
</blockquote>
</div>
</div>
