content/man/man1/git-rev-parse.1.org
** Options for Files
--local-env-vars

#+begin_quote
List the GIT_* environment variables that are local to the repository
(e.g. GIT_DIR or GIT_WORK_TREE, but not GIT_EDITOR). Only the names of
the variables are listed, not their value, even if they are set.

#+end_quote

--path-format=(absolute|relative)

#+begin_quote
Controls the behavior of certain other options. If specified as
absolute, the paths printed by those options will be absolute and
canonical. If specified as relative, the paths will be relative to the
current working directory if that is possible. The default is option
specific.

This option may be specified multiple times and affects only the
arguments that follow it on the command line, either to the end of the
command line or the next instance of this option.

#+end_quote

The following options are modified by *--path-format*:

--git-dir

#+begin_quote
Show *$GIT_DIR* if defined. Otherwise show the path to the .git
directory. The path shown, when relative, is relative to the current
working directory.

If *$GIT_DIR* is not defined and the current directory is not detected
to lie in a Git repository or work tree print a message to stderr and
exit with nonzero status.

#+end_quote

--git-common-dir

#+begin_quote
Show *$GIT_COMMON_DIR* if defined, else *$GIT_DIR*.

#+end_quote

--resolve-git-dir <path>

#+begin_quote
Check if <path> is a valid repository or a gitfile that points at a
valid repository, and print the location of the repository. If <path> is
a gitfile then the resolved path to the real repository is printed.

#+end_quote

--git-path <path>

#+begin_quote
Resolve "$GIT_DIR/<path>" and takes other path relocation variables such
as $GIT_OBJECT_DIRECTORY, $GIT_INDEX_FILE... into account. For example,
if $GIT_OBJECT_DIRECTORY is set to /foo/bar then "git rev-parse
--git-path objects/abc" returns /foo/bar/abc.

#+end_quote

--show-toplevel

#+begin_quote
Show the (by default, absolute) path of the top-level directory of the
working tree. If there is no working tree, report an error.

#+end_quote

--show-superproject-working-tree

#+begin_quote
Show the absolute path of the root of the superproject's working tree
(if exists) that uses the current repository as its submodule. Outputs
nothing if the current repository is not used as a submodule by any
project.

#+end_quote

--shared-index-path

#+begin_quote
Show the path to the shared index file in split index mode, or empty if
not in split-index mode.

#+end_quote

The following options are unaffected by *--path-format*:

--absolute-git-dir

#+begin_quote
Like *--git-dir*, but its output is always the canonicalized absolute
path.

#+end_quote

--is-inside-git-dir

#+begin_quote
When the current working directory is below the repository directory
print "true", otherwise "false".

#+end_quote

--is-inside-work-tree

#+begin_quote
When the current working directory is inside the work tree of the
repository print "true", otherwise "false".

#+end_quote

--is-bare-repository

#+begin_quote
When the repository is bare print "true", otherwise "false".

#+end_quote

--is-shallow-repository

#+begin_quote
When the repository is shallow print "true", otherwise "false".

#+end_quote

--show-cdup

#+begin_quote
When the command is invoked from a subdirectory, show the path of the
top-level directory relative to the current directory (typically a
sequence of "../", or an empty string).

#+end_quote

--show-prefix

#+begin_quote
When the command is invoked from a subdirectory, show the path of the
current directory relative to the top-level directory.

#+end_quote

--show-object-format[=(storage|input|output)]

#+begin_quote
Show the object format (hash algorithm) used for the repository for
storage inside the *.git* directory, input, or output. For input,
multiple algorithms may be printed, space-separated. If not specified,
the default is "storage".

#+end_quote

--show-ref-format

#+begin_quote
Show the reference storage format used for the repository.

#+end_quote

** Other Options
--since=<datestring>, --after=<datestring>

#+begin_quote
Parse the date string, and output the corresponding --max-age= parameter
for /git rev-list/.

#+end_quote

--until=<datestring>, --before=<datestring>

#+begin_quote
Parse the date string, and output the corresponding --min-age= parameter
for /git rev-list/.

#+end_quote

<arg>...

#+begin_quote
Flags and parameters to be parsed.

#+end_quote

