public/man/man1/git-rev-parse.1/index.html
<div id="outline-container-headline-10" class="outline-3">
<h3 id="headline-10">
Options for Files
</h3>
<div id="outline-text-headline-10" class="outline-text-3">
<p>–local-env-vars</p>
<blockquote>
<p>List the GIT_* environment variables that are local to the repository
(e.g. GIT_DIR or GIT_WORK_TREE, but not GIT_EDITOR). Only the names of
the variables are listed, not their value, even if they are set.</p>
</blockquote>
<p>
–path-format=(absolute|relative)</p>
<blockquote>
<p>Controls the behavior of certain other options. If specified as
absolute, the paths printed by those options will be absolute and
canonical. If specified as relative, the paths will be relative to the
current working directory if that is possible. The default is option
specific.</p>
<p>
This option may be specified multiple times and affects only the
arguments that follow it on the command line, either to the end of the
command line or the next instance of this option.</p>
</blockquote>
<p>
The following options are modified by <strong>–path-format</strong>:</p>
<p>
–git-dir</p>
<blockquote>
<p>Show <strong>$GIT_DIR</strong> if defined. Otherwise show the path to the .git
directory. The path shown, when relative, is relative to the current
working directory.</p>
<p>
If <strong>$GIT_DIR</strong> is not defined and the current directory is not detected
to lie in a Git repository or work tree print a message to stderr and
exit with nonzero status.</p>
</blockquote>
<p>
–git-common-dir</p>
<blockquote>
<p>Show <strong>$GIT_COMMON_DIR</strong> if defined, else <strong>$GIT_DIR</strong>.</p>
</blockquote>
<p>
–resolve-git-dir &lt;path&gt;</p>
<blockquote>
<p>Check if &lt;path&gt; is a valid repository or a gitfile that points at a
valid repository, and print the location of the repository. If &lt;path&gt; is
a gitfile then the resolved path to the real repository is printed.</p>
</blockquote>
<p>
–git-path &lt;path&gt;</p>
<blockquote>
<p>Resolve &#34;$GIT_DIR/&lt;path&gt;&#34; and takes other path relocation variables such
as $GIT_OBJECT_DIRECTORY, $GIT_INDEX_FILE... into account. For example,
if $GIT_OBJECT_DIRECTORY is set to /foo/bar then &#34;git rev-parse
–git-path objects/abc&#34; returns /foo/bar/abc.</p>
</blockquote>
<p>
–show-toplevel</p>
<blockquote>
<p>Show the (by default, absolute) path of the top-level directory of the
working tree. If there is no working tree, report an error.</p>
</blockquote>
<p>
–show-superproject-working-tree</p>
<blockquote>
<p>Show the absolute path of the root of the superproject&#39;s working tree
(if exists) that uses the current repository as its submodule. Outputs
nothing if the current repository is not used as a submodule by any
project.</p>
</blockquote>
<p>
–shared-index-path</p>
<blockquote>
<p>Show the path to the shared index file in split index mode, or empty if
not in split-index mode.</p>
</blockquote>
<p>
The following options are unaffected by <strong>–path-format</strong>:</p>
<p>
–absolute-git-dir</p>
<blockquote>
<p>Like <strong>–git-dir</strong>, but its output is always the canonicalized absolute
path.</p>
</blockquote>
<p>
–is-inside-git-dir</p>
<blockquote>
<p>When the current working directory is below the repository directory
print &#34;true&#34;, otherwise &#34;false&#34;.</p>
</blockquote>
<p>
–is-inside-work-tree</p>
<blockquote>
<p>When the current working directory is inside the work tree of the
repository print &#34;true&#34;, otherwise &#34;false&#34;.</p>
</blockquote>
<p>
–is-bare-repository</p>
<blockquote>
<p>When the repository is bare print &#34;true&#34;, otherwise &#34;false&#34;.</p>
</blockquote>
<p>
–is-shallow-repository</p>
<blockquote>
<p>When the repository is shallow print &#34;true&#34;, otherwise &#34;false&#34;.</p>
</blockquote>
<p>
–show-cdup</p>
<blockquote>
<p>When the command is invoked from a subdirectory, show the path of the
top-level directory relative to the current directory (typically a
sequence of &#34;../&#34;, or an empty string).</p>
</blockquote>
<p>
–show-prefix</p>
<blockquote>
<p>When the command is invoked from a subdirectory, show the path of the
current directory relative to the top-level directory.</p>
</blockquote>
<p>
–show-object-format[=(storage|input|output)]</p>
<blockquote>
<p>Show the object format (hash algorithm) used for the repository for
storage inside the <strong>.git</strong> directory, input, or output. For input,
multiple algorithms may be printed, space-separated. If not specified,
the default is &#34;storage&#34;.</p>
</blockquote>
<p>
–show-ref-format</p>
<blockquote>
<p>Show the reference storage format used for the repository.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-11" class="outline-3">
<h3 id="headline-11">
Other Options
</h3>
<div id="outline-text-headline-11" class="outline-text-3">
<p>–since=&lt;datestring&gt;, –after=&lt;datestring&gt;</p>
<blockquote>
<p>Parse the date string, and output the corresponding –max-age= parameter
for <em>git rev-list</em>.</p>
</blockquote>
<p>
–until=&lt;datestring&gt;, –before=&lt;datestring&gt;</p>
<blockquote>
<p>Parse the date string, and output the corresponding –min-age= parameter
for <em>git rev-list</em>.</p>
</blockquote>
<p>
&lt;arg&gt;…</p>
<blockquote>
<p>Flags and parameters to be parsed.</p>
</blockquote>
</div>
</div>
</div>
</div>
