public/man/man1/git-rev-parse.1/index.html
<div id="outline-container-headline-12" class="outline-2">
<h2 id="headline-12">
SPECIFYING REVISIONS
</h2>
<div id="outline-text-headline-12" class="outline-text-2">
<p>A revision parameter <em>&lt;rev&gt;</em> typically, but not necessarily, names a
commit object. It uses what is called an <em>extended SHA-1</em> syntax. Here
are various ways to spell object names. The ones listed near the end of
this list name trees and blobs contained in a commit.</p>
<blockquote>
<p>\\</p>
<p>
<strong>Note</strong></p>
<p>
\\</p>
<p>
This document shows the &#34;raw&#34; syntax as seen by git. The shell and other
UIs might require additional quoting to protect special characters and
to avoid word splitting.</p>
</blockquote>
<p>
<em>&lt;sha1&gt;</em>, e.g. <em>dae86e1950b1277e545cee180551750029cfe735</em>, <em>dae86e</em></p>
<blockquote>
<p>The full SHA-1 object name (40-byte hexadecimal string), or a leading
substring that is unique within the repository. E.g.
dae86e1950b1277e545cee180551750029cfe735 and dae86e both name the same
commit object if there is no other object in your repository whose
object name starts with dae86e.</p>
</blockquote>
<p>
<em>&lt;describeOutput&gt;</em>, e.g. <em>v1.7.4.2-679-g3bee7fb</em></p>
<blockquote>
<p>Output from <strong>git describe</strong>; i.e. a closest tag, optionally followed by a
dash and a number of commits, followed by a dash, a <em>g</em>, and an
abbreviated object name.</p>
</blockquote>
<p>
<em>&lt;refname&gt;</em>, e.g. <em>master</em>, <em>heads/master</em>, <em>refs/heads/master</em></p>
<blockquote>
<p>A symbolic ref name. E.g. <em>master</em> typically means the commit object
referenced by <em>refs/heads/master</em>. If you happen to have both
<em>heads/master</em> and <em>tags/master</em>, you can explicitly say <em>heads/master</em>
to tell Git which one you mean. When ambiguous, a <em>&lt;refname&gt;</em> is
disambiguated by taking the first match in the following rules:</p>
<blockquote>
<ol>
<li></li>
</ol>
<p>If <em>$GIT_DIR/&lt;refname&gt;</em> exists, that is what you mean (this is usually
useful only for <strong>HEAD</strong>, <strong>FETCH_HEAD</strong>, <strong>ORIG_HEAD</strong>, <strong>MERGE_HEAD</strong>,
<strong>REBASE_HEAD</strong>, <strong>REVERT_HEAD</strong>, <strong>CHERRY_PICK_HEAD</strong>, <strong>BISECT_HEAD</strong> and
<strong>AUTO_MERGE</strong>);</p>
</blockquote>
<blockquote>
<ol>
<li></li>
</ol>
<p>otherwise, <em>refs/&lt;refname&gt;</em> if it exists;</p>
</blockquote>
<blockquote>
<ol>
<li></li>
</ol>
<p>otherwise, <em>refs/tags/&lt;refname&gt;</em> if it exists;</p>
</blockquote>
<blockquote>
<ol>
<li></li>
</ol>
<p>otherwise, <em>refs/heads/&lt;refname&gt;</em> if it exists;</p>
</blockquote>
<blockquote>
<ol>
<li></li>
</ol>
<p>otherwise, <em>refs/remotes/&lt;refname&gt;</em> if it exists;</p>
</blockquote>
<blockquote>
<ol>
<li></li>
</ol>
<p>otherwise, <em>refs/remotes/&lt;refname&gt;/HEAD</em> if it exists.</p>
</blockquote>
<p>
<strong>HEAD</strong></p>
<blockquote>
<p>names the commit on which you based the changes in the working tree.</p>
</blockquote>
<p>
<strong>FETCH_HEAD</strong></p>
<blockquote>
<p>records the branch which you fetched from a remote repository with your
last <strong>git fetch</strong> invocation.</p>
</blockquote>
<p>
<strong>ORIG_HEAD</strong></p>
<blockquote>
<p>is created by commands that move your <strong>HEAD</strong> in a drastic way (<strong>git am</strong>,
<strong>git merge</strong>, <strong>git rebase</strong>, <strong>git reset</strong>), to record the position of the
<strong>HEAD</strong> before their operation, so that you can easily change the tip of
the branch back to the state before you ran them.</p>
</blockquote>
<p>
<strong>MERGE_HEAD</strong></p>
<blockquote>
<p>records the commit(s) which you are merging into your branch when you
run <strong>git merge</strong>.</p>
</blockquote>
<p>
<strong>REBASE_HEAD</strong></p>
<blockquote>
<p>during a rebase, records the commit at which the operation is currently
stopped, either because of conflicts or an <strong>edit</strong> command in an
interactive rebase.</p>
</blockquote>
<p>
<strong>REVERT_HEAD</strong></p>
<blockquote>
<p>records the commit which you are reverting when you run <strong>git revert</strong>.</p>
</blockquote>
<p>
<strong>CHERRY_PICK_HEAD</strong></p>
<blockquote>
<p>records the commit which you are cherry-picking when you run <strong>git
cherry-pick</strong>.</p>
</blockquote>
<p>
<strong>BISECT_HEAD</strong></p>
<blockquote>
<p>records the current commit to be tested when you run <strong>git bisect
–no-checkout</strong>.</p>
</blockquote>
<p>
<strong>AUTO_MERGE</strong></p>
<blockquote>
<p>records a tree object corresponding to the state the <em>ort</em> merge
strategy wrote to the working tree when a merge operation resulted in
conflicts.</p>
</blockquote>
<p>
Note that any of the <em>refs/*</em> cases above may come either from the
<strong>$GIT_DIR/refs</strong> directory or from the <strong>$GIT_DIR/packed-refs</strong> file. While
the ref name encoding is unspecified, UTF-8 is preferred as some output
processing may assume ref names in UTF-8.</p>
</blockquote>
<p>
<em>@</em></p>
<blockquote>
<p><em>@</em> alone is a shortcut for <strong>HEAD</strong>.</p>
</blockquote>
<p>
<em>[&lt;refname&gt;]@{&lt;date&gt;}</em>, e.g. <em>master@{yesterday}</em>, <em>HEAD@{5 minutes
ago}</em></p>
<blockquote>
<p>A ref followed by the suffix <em>@</em> with a date specification enclosed in a
brace pair (e.g. <em>{yesterday}</em>, <em>{1 month 2 weeks 3 days 1 hour 1 second
ago}</em> or <em>{1979-02-26 18:30:00}</em>) specifies the value of the ref at a
prior point in time. This suffix may only be used immediately following
a ref name and the ref must have an existing log
(<em>$GIT_DIR/logs/&lt;ref&gt;</em>). Note that this looks up the state of your
<strong>local</strong> ref at a given time; e.g., what was in your local <em>master</em>
branch last week. If you want to look at commits made during certain
times, see <strong>–since</strong> and <strong>–until</strong>.</p>
</blockquote>
<p>
<em>&lt;refname&gt;@{&lt;n&gt;}</em>, e.g. <em>master@{1}</em></p>
<blockquote>
<p>A ref followed by the suffix <em>@</em> with an ordinal specification enclosed
in a brace pair (e.g. <em>{1}</em>, <em>{15}</em>) specifies the n-th prior value of
that ref. For example <em>master@{1}</em> is the immediate prior value of
<em>master</em> while <em>master@{5}</em> is the 5th prior value of <em>master</em>. This
suffix may only be used immediately following a ref name and the ref
must have an existing log (<em>$GIT_DIR/logs/&lt;refname&gt;</em>).</p>
</blockquote>
<p>
<em>@{&lt;n&gt;}</em>, e.g. <em>@{1}</em></p>
<blockquote>
<p>You can use the <em>@</em> construct with an empty ref part to get at a reflog
entry of the current branch. For example, if you are on branch <em>blabla</em>
then <em>@{1}</em> means the same as <em>blabla@{1}</em>.</p>
</blockquote>
<p>
<em>@{-&lt;n&gt;}</em>, e.g. <em>@{-1}</em></p>
<blockquote>
<p>The construct <em>@{-&lt;n&gt;}</em> means the &lt;n&gt;th branch/commit checked out before
the current one.</p>
</blockquote>
<p>
<em>[&lt;branchname&gt;]@{upstream}</em>, e.g. <em>master@{upstream}</em>, <em>@{u}</em></p>
<blockquote>
<p>A branch B may be set up to build on top of a branch X (configured with
<strong>branch.&lt;name&gt;.merge</strong>) at a remote R (configured with the branch X taken
from remote R, typically found at <strong>refs/remotes/R/X</strong>.</p>
</blockquote>
<p>
<em>[&lt;branchname&gt;]@{push}</em>, e.g. <em>master@{push}</em>, <em>@{push}</em></p>
<blockquote>
<p>The suffix <em>@{push}</em> reports the branch &#34;where we would push to&#34; if <strong>git
push</strong> were run while <strong>branchname</strong> was checked out (or the current <strong>HEAD</strong>
if no branchname is specified). Like for <em>@{upstream}</em>, we report the
remote-tracking branch that corresponds to that branch at the remote.</p>
<p>
Here&#39;s an example to make it more clear:</p>
<blockquote>
<pre class="example">
$ git config push.default current
$ git config remote.pushdefault myfork
$ git switch -c mybranch origin/master

$ git rev-parse --symbolic-full-name @{upstream}
refs/remotes/origin/master

$ git rev-parse --symbolic-full-name @{push}
refs/remotes/myfork/mybranch
</pre>
</blockquote>
<p>
Note in the example that we set up a triangular workflow, where we pull
from one location and push to another. In a non-triangular workflow,
<em>@{push}</em> is the same as <em>@{upstream}</em>, and there is no need for it.</p>
<p>
This suffix is also accepted when spelled in uppercase, and means the
same thing no matter the case.</p>
</blockquote>
<p>
<em>&lt;rev&gt;^[&lt;n&gt;]</em>, e.g. <em>HEAD^, v1.5.1^0</em></p>
<blockquote>
<p>A suffix <em>^</em> to a revision parameter means the first parent of that
commit object. <em>^&lt;n&gt;</em> means the &lt;n&gt;th parent (i.e. <em>&lt;rev&gt;^</em> is
equivalent to <em>&lt;rev&gt;^1</em>). As a special rule, <em>&lt;rev&gt;^0</em> means the commit
itself and is used when <em>&lt;rev&gt;</em> is the object name of a tag object that
refers to a commit object.</p>
</blockquote>
<p>
<em>&lt;rev&gt;~[&lt;n&gt;]</em>, e.g. <em>HEAD~, master~3</em></p>
<blockquote>
<p>A suffix <em>~</em> to a revision parameter means the first parent of that
commit object. A suffix <em>~&lt;n&gt;</em> to a revision parameter means the commit
object that is the &lt;n&gt;th generation ancestor of the named commit object,
following only the first parents. I.e. <em>&lt;rev&gt;~3</em> is equivalent to
<em>&lt;rev&gt;^^^</em> which is equivalent to <em>&lt;rev&gt;^1^1^1</em>. See below for an
illustration of the usage of this form.</p>
</blockquote>
<p>
<em>&lt;rev&gt;<sup>&lt;type&gt;</sup></em>, e.g. <em>v0.99.8<sup>commit</sup></em></p>
<blockquote>
<p>A suffix <em>^</em> followed by an object type name enclosed in brace pair
means dereference the object at <em>&lt;rev&gt;</em> recursively until an object of
type <em>&lt;type&gt;</em> is found or the object cannot be dereferenced anymore (in
which case, barf). For example, if <em>&lt;rev&gt;</em> is a commit-ish,
<em>&lt;rev&gt;<sup>commit</sup></em> describes the corresponding commit object. Similarly,
if <em>&lt;rev&gt;</em> is a tree-ish, <em>&lt;rev&gt;<sup>tree</sup></em> describes the corresponding
tree object. <em>&lt;rev&gt;^0</em> is a short-hand for <em>&lt;rev&gt;<sup>commit</sup></em>.</p>
<p>
<em>&lt;rev&gt;<sup>object</sup></em> can be used to make sure <em>&lt;rev&gt;</em> names an object that
exists, without requiring <em>&lt;rev&gt;</em> to be a tag, and without dereferencing
<em>&lt;rev&gt;</em>; because a tag is already an object, it does not have to be
dereferenced even once to get to an object.</p>
<p>
<em>&lt;rev&gt;<sup>tag</sup></em> can be used to ensure that <em>&lt;rev&gt;</em> identifies an existing
tag object.</p>
</blockquote>
<p>
<em>&lt;rev&gt;^{}</em>, e.g. <em>v0.99.8^{}</em></p>
<blockquote>
<p>A suffix <em>^</em> followed by an empty brace pair means the object could be a
tag, and dereference the tag recursively until a non-tag object is
found.</p>
</blockquote>
<p>
<em>&lt;rev&gt;<sup>/&lt;text&gt;</sup></em>, e.g. <em>HEAD<sup>/fix nasty bug</sup></em></p>
<blockquote>
<p>A suffix <em>^</em> to a revision parameter, followed by a brace pair that
contains a text led by a slash, is the same as the <em>:/fix nasty bug</em>
syntax below except that it returns the youngest matching commit which
is reachable from the <em>&lt;rev&gt;</em> before <em>^</em>.</p>
</blockquote>
<p>
<em>:/&lt;text&gt;</em>, e.g. <em>:/fix nasty bug</em></p>
<blockquote>
<p>A colon, followed by a slash, followed by a text, names a commit whose
commit message matches the specified regular expression. This name
returns the youngest matching commit which is reachable from any ref,
including HEAD. The regular expression can match any part of the commit
message. To match messages starting with a string, one can use e.g.
<em>:/^foo</em>. The special sequence <em>:</em>!/ is reserved for modifiers to what
is matched. <em>:</em>!-foo/ performs a negative match, while <em>:</em>!!foo/ matches
a literal <em>!</em> character, followed by <em>foo</em>. Any other sequence beginning
with <em>:</em>!/ is reserved for now. Depending on the given text, the shell&#39;s
word splitting rules might require additional quoting.</p>
</blockquote>
<p>
<em>&lt;rev&gt;:&lt;path&gt;</em>, e.g. <em>HEAD:README</em>, <em>master:./README</em></p>
<blockquote>
<p>A suffix <em>:</em> followed by a path names the blob or tree at the given path
in the tree-ish object named by the part before the colon. A path
starting with <em>./</em> or <em>../</em> is relative to the current working
directory. The given path will be converted to be relative to the
working tree&#39;s root directory. This is most useful to address a blob or
tree from a commit or tree that has the same tree structure as the
working tree.</p>
</blockquote>
<p>
<em>:[&lt;n&gt;:]&lt;path&gt;</em>, e.g. <em>:0:README</em>, <em>:README</em></p>
<blockquote>
<p>A colon, optionally followed by a stage number (0 to 3) and a colon,
followed by a path, names a blob object in the index at the given path.
A missing stage number (and the colon that follows it) names a stage 0
entry. During a merge, stage 1 is the common ancestor, stage 2 is the
target branch&#39;s version (typically the current branch), and stage 3 is
the version from the branch which is being merged.</p>
</blockquote>
<p>
Here is an illustration, by Jon Loeliger. Both commit nodes B and C are
parents of commit node A. Parent commits are ordered left-to-right.</p>
<blockquote>
<pre class="example">
G   H   I   J
 \ /     \ /
  D   E   F
   \  |  / \
    \ | /   |
     \|/    |
      B     C
       \   /
        \ /
         A
</pre>
</blockquote>
<blockquote>
<pre class="example">
A =      = A^0
B = A^   = A^1     = A~1
C =      = A^2
D = A^^  = A^1^1   = A~2
E = B^2  = A^^2
F = B^3  = A^^3
G = A^^^ = A^1^1^1 = A~3
H = D^2  = B^^2    = A^^^2  = A~2^2
I = F^   = B^3^    = A^^3^
J = F^2  = B^3^2   = A^^3^2
</pre>
</blockquote>
</div>
</div>
