content/man/man1/git-rev-parse.1.org
* SPECIFYING RANGES
History traversing commands such as *git log* operate on a set of
commits, not just a single commit.

For these commands, specifying a single revision, using the notation
described in the previous section, means the set of commits *reachable*
from the given commit.

Specifying several revisions means the set of commits reachable from any
of the given commits.

A commit's reachable set is the commit itself and the commits in its
ancestry chain.

There are several notations to specify a set of connected commits
(called a "revision range"), illustrated below.

** Commit Exclusions
/^<rev>/ (caret) Notation

#+begin_quote
To exclude commits reachable from a commit, a prefix /^/ notation is
used. E.g. /^r1 r2/ means commits reachable from /r2/ but exclude the
ones reachable from /r1/ (i.e. /r1/ and its ancestors).

#+end_quote

** Dotted Range Notations
The /../ (two-dot) Range Notation

#+begin_quote
The /^r1 r2/ set operation appears so often that there is a shorthand
for it. When you have two commits /r1/ and /r2/ (named according to the
syntax explained in SPECIFYING REVISIONS above), you can ask for commits
that are reachable from r2 excluding those that are reachable from r1 by
/^r1 r2/ and it can be written as /r1..r2/.

#+end_quote

The /.../ (three-dot) Symmetric Difference Notation

#+begin_quote
A similar notation /r1...r2/ is called symmetric difference of /r1/ and
/r2/ and is defined as /r1 r2 --not $(git merge-base --all r1 r2)/. It
is the set of commits that are reachable from either one of /r1/ (left
side) or /r2/ (right side) but not from both.

#+end_quote

In these two shorthand notations, you can omit one end and let it
default to HEAD. For example, /origin../ is a shorthand for
/origin..HEAD/ and asks "What did I do since I forked from the origin
branch?" Similarly, /..origin/ is a shorthand for /HEAD..origin/ and
asks "What did the origin do since I forked from them?" Note that /../
would mean /HEAD..HEAD/ which is an empty range that is both reachable
and unreachable from HEAD.

Commands that are specifically designed to take two distinct ranges
(e.g. "git range-diff R1 R2" to compare two ranges) do exist, but they
are exceptions. Unless otherwise noted, all "git" commands that operate
on a set of commits work on a single revision range. In other words,
writing two "two-dot range notation" next to each other, e.g.

#+begin_quote
#+begin_example
$ git log A..B C..D
#+end_example

#+end_quote

does *not* specify two revision ranges for most commands. Instead it
will name a single connected set of commits, i.e. those that are
reachable from either B or D but are reachable from neither A or C. In a
linear history like this:

#+begin_quote
#+begin_example
---A---B---o---o---C---D
#+end_example

#+end_quote

because A and B are reachable from C, the revision range specified by
these two dotted ranges is a single commit D.

** Other <rev>^ Parent Shorthand Notations
Three other shorthands exist, particularly useful for merge commits, for
naming a set that is formed by a commit and its parent commits.

The /r1^@/ notation means all parents of /r1/.

The /r1^!/ notation includes commit /r1/ but excludes all of its
parents. By itself, this notation denotes the single commit /r1/.

The /<rev>^-[<n>]/ notation includes /<rev>/ but excludes the <n>th
parent (i.e. a shorthand for /<rev>^<n>..<rev>/), with /<n>/ = 1 if not
given. This is typically useful for merge commits where you can just
pass /<commit>^-/ to get all the commits in the branch that was merged
in merge commit /<commit>/ (including /<commit>/ itself).

While /<rev>^<n>/ was about specifying a single commit parent, these
three notations also consider its parents. For example you can say
/HEAD^2^@/, however you cannot say /HEAD^@^2/.

* REVISION RANGE SUMMARY
/<rev>/

#+begin_quote
Include commits that are reachable from <rev> (i.e. <rev> and its
ancestors).

#+end_quote

/^<rev>/

#+begin_quote
Exclude commits that are reachable from <rev> (i.e. <rev> and its
ancestors).

#+end_quote

/<rev1>..<rev2>/

#+begin_quote
Include commits that are reachable from <rev2> but exclude those that
are reachable from <rev1>. When either <rev1> or <rev2> is omitted, it
defaults to *HEAD*.

#+end_quote

/<rev1>...<rev2>/

#+begin_quote
Include commits that are reachable from either <rev1> or <rev2> but
exclude those that are reachable from both. When either <rev1> or <rev2>
is omitted, it defaults to *HEAD*.

#+end_quote

/<rev>^@/, e.g. /HEAD^@/

#+begin_quote
A suffix /^/ followed by an at sign is the same as listing all parents
of /<rev>/ (meaning, include anything reachable from its parents, but
not the commit itself).

#+end_quote

/<rev>^!/, e.g. /HEAD^!/

#+begin_quote
A suffix /^/ followed by an exclamation mark is the same as giving
commit /<rev>/ and all its parents prefixed with /^/ to exclude them
(and their ancestors).

#+end_quote

/<rev>^-<n>/, e.g. /HEAD^-, HEAD^-2/

#+begin_quote
Equivalent to /<rev>^<n>..<rev>/, with /<n>/ = 1 if not given.

#+end_quote

Here are a handful of examples using the Loeliger illustration above,
with each step in the notation's expansion and selection carefully spelt
out:

#+begin_quote
#+begin_example
   Args   Expanded arguments    Selected commits
   D                            G H D
   D F                          G H I J D F
   ^G D                         H D
   ^D B                         E I J F B
   ^D B C                       E I J F B C
   C                            I J F C
   B..C   = ^B C                C
   B...C  = B ^F C              G H D E B C
   B^-    = B^..B
          = ^B^1 B              E I J F B
   C^@    = C^1
          = F                   I J F
   B^@    = B^1 B^2 B^3
          = D E F               D G H E F I J
   C^!    = C ^C^@
          = C ^C^1
          = C ^F                C
   B^!    = B ^B^@
          = B ^B^1 ^B^2 ^B^3
          = B ^D ^E ^F          B
   F^! D  = F ^I ^J D           G H D F
#+end_example

#+end_quote

* PARSEOPT
In *--parseopt* mode, /git rev-parse/ helps massaging options to bring
to shell scripts the same facilities C builtins have. It works as an
option normalizer (e.g. splits single switches aggregate values), a bit
like *getopt(1)* does.

It takes on the standard input the specification of the options to parse
and understand, and echoes on the standard output a string suitable for
*sh(1)* *eval* to replace the arguments with normalized ones. In case of
error, it outputs usage on the standard error stream, and exits with
code 129.

Note: Make sure you quote the result when passing it to *eval*. See
below for an example.

