public/man/man1/git-rev-parse.1/index.html
<div id="outline-container-headline-13" class="outline-2">
<h2 id="headline-13">
SPECIFYING RANGES
</h2>
<div id="outline-text-headline-13" class="outline-text-2">
<p>History traversing commands such as <strong>git log</strong> operate on a set of
commits, not just a single commit.</p>
<p>
For these commands, specifying a single revision, using the notation
described in the previous section, means the set of commits <strong>reachable</strong>
from the given commit.</p>
<p>
Specifying several revisions means the set of commits reachable from any
of the given commits.</p>
<p>
A commit&#39;s reachable set is the commit itself and the commits in its
ancestry chain.</p>
<p>
There are several notations to specify a set of connected commits
(called a &#34;revision range&#34;), illustrated below.</p>
<div id="outline-container-headline-14" class="outline-3">
<h3 id="headline-14">
Commit Exclusions
</h3>
<div id="outline-text-headline-14" class="outline-text-3">
<p><em>^&lt;rev&gt;</em> (caret) Notation</p>
<blockquote>
<p>To exclude commits reachable from a commit, a prefix <em>^</em> notation is
used. E.g. <em>^r1 r2</em> means commits reachable from <em>r2</em> but exclude the
ones reachable from <em>r1</em> (i.e. <em>r1</em> and its ancestors).</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-15" class="outline-3">
<h3 id="headline-15">
Dotted Range Notations
</h3>
<div id="outline-text-headline-15" class="outline-text-3">
<p>The <em>..</em> (two-dot) Range Notation</p>
<blockquote>
<p>The <em>^r1 r2</em> set operation appears so often that there is a shorthand
for it. When you have two commits <em>r1</em> and <em>r2</em> (named according to the
syntax explained in SPECIFYING REVISIONS above), you can ask for commits
that are reachable from r2 excluding those that are reachable from r1 by
<em>^r1 r2</em> and it can be written as <em>r1..r2</em>.</p>
</blockquote>
<p>
The <em>…</em> (three-dot) Symmetric Difference Notation</p>
<blockquote>
<p>A similar notation <em>r1…r2</em> is called symmetric difference of <em>r1</em> and
<em>r2</em> and is defined as <em>r1 r2 –not $(git merge-base –all r1 r2)</em>. It
is the set of commits that are reachable from either one of <em>r1</em> (left
side) or <em>r2</em> (right side) but not from both.</p>
</blockquote>
<p>
In these two shorthand notations, you can omit one end and let it
default to HEAD. For example, <em>origin..</em> is a shorthand for
<em>origin..HEAD</em> and asks &#34;What did I do since I forked from the origin
branch?&#34; Similarly, <em>..origin</em> is a shorthand for <em>HEAD..origin</em> and
asks &#34;What did the origin do since I forked from them?&#34; Note that <em>..</em>
would mean <em>HEAD..HEAD</em> which is an empty range that is both reachable
and unreachable from HEAD.</p>
<p>
Commands that are specifically designed to take two distinct ranges
(e.g. &#34;git range-diff R1 R2&#34; to compare two ranges) do exist, but they
are exceptions. Unless otherwise noted, all &#34;git&#34; commands that operate
on a set of commits work on a single revision range. In other words,
writing two &#34;two-dot range notation&#34; next to each other, e.g.</p>
<blockquote>
<pre class="example">
$ git log A..B C..D
</pre>
</blockquote>
<p>
does <strong>not</strong> specify two revision ranges for most commands. Instead it
will name a single connected set of commits, i.e. those that are
reachable from either B or D but are reachable from neither A or C. In a
linear history like this:</p>
<blockquote>
<pre class="example">
---A---B---o---o---C---D
</pre>
</blockquote>
<p>
because A and B are reachable from C, the revision range specified by
these two dotted ranges is a single commit D.</p>
</div>
</div>
<div id="outline-container-headline-16" class="outline-3">
<h3 id="headline-16">
Other &lt;rev&gt;^ Parent Shorthand Notations
</h3>
<div id="outline-text-headline-16" class="outline-text-3">
<p>Three other shorthands exist, particularly useful for merge commits, for
naming a set that is formed by a commit and its parent commits.</p>
<p>
The <em>r1^@</em> notation means all parents of <em>r1</em>.</p>
<p>
The <em>r1^!</em> notation includes commit <em>r1</em> but excludes all of its
parents. By itself, this notation denotes the single commit <em>r1</em>.</p>
<p>
The <em>&lt;rev&gt;^-[&lt;n&gt;]</em> notation includes <em>&lt;rev&gt;</em> but excludes the &lt;n&gt;th
parent (i.e. a shorthand for <em>&lt;rev&gt;^&lt;n&gt;..&lt;rev&gt;</em>), with <em>&lt;n&gt;</em> = 1 if not
given. This is typically useful for merge commits where you can just
pass <em>&lt;commit&gt;^-</em> to get all the commits in the branch that was merged
in merge commit <em>&lt;commit&gt;</em> (including <em>&lt;commit&gt;</em> itself).</p>
<p>
While <em>&lt;rev&gt;^&lt;n&gt;</em> was about specifying a single commit parent, these
three notations also consider its parents. For example you can say
<em>HEAD^2^@</em>, however you cannot say <em>HEAD^@^2</em>.</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-17" class="outline-2">
<h2 id="headline-17">
REVISION RANGE SUMMARY
</h2>
<div id="outline-text-headline-17" class="outline-text-2">
<p><em>&lt;rev&gt;</em></p>
<blockquote>
<p>Include commits that are reachable from &lt;rev&gt; (i.e. &lt;rev&gt; and its
ancestors).</p>
</blockquote>
<p>
<em>^&lt;rev&gt;</em></p>
<blockquote>
<p>Exclude commits that are reachable from &lt;rev&gt; (i.e. &lt;rev&gt; and its
ancestors).</p>
</blockquote>
<p>
<em>&lt;rev1&gt;..&lt;rev2&gt;</em></p>
<blockquote>
<p>Include commits that are reachable from &lt;rev2&gt; but exclude those that
are reachable from &lt;rev1&gt;. When either &lt;rev1&gt; or &lt;rev2&gt; is omitted, it
defaults to <strong>HEAD</strong>.</p>
</blockquote>
<p>
<em>&lt;rev1&gt;…&lt;rev2&gt;</em></p>
<blockquote>
<p>Include commits that are reachable from either &lt;rev1&gt; or &lt;rev2&gt; but
exclude those that are reachable from both. When either &lt;rev1&gt; or &lt;rev2&gt;
is omitted, it defaults to <strong>HEAD</strong>.</p>
</blockquote>
<p>
<em>&lt;rev&gt;^@</em>, e.g. <em>HEAD^@</em></p>
<blockquote>
<p>A suffix <em>^</em> followed by an at sign is the same as listing all parents
of <em>&lt;rev&gt;</em> (meaning, include anything reachable from its parents, but
not the commit itself).</p>
</blockquote>
<p>
<em>&lt;rev&gt;^!</em>, e.g. <em>HEAD^!</em></p>
<blockquote>
<p>A suffix <em>^</em> followed by an exclamation mark is the same as giving
commit <em>&lt;rev&gt;</em> and all its parents prefixed with <em>^</em> to exclude them
(and their ancestors).</p>
</blockquote>
<p>
<em>&lt;rev&gt;^-&lt;n&gt;</em>, e.g. <em>HEAD^-, HEAD^-2</em></p>
<blockquote>
<p>Equivalent to <em>&lt;rev&gt;^&lt;n&gt;..&lt;rev&gt;</em>, with <em>&lt;n&gt;</em> = 1 if not given.</p>
</blockquote>
<p>
Here are a handful of examples using the Loeliger illustration above,
with each step in the notation&#39;s expansion and selection carefully spelt
out:</p>
<blockquote>
<pre class="example">
   Args   Expanded arguments    Selected commits
   D                            G H D
   D F                          G H I J D F
   ^G D                         H D
   ^D B                         E I J F B
   ^D B C                       E I J F B C
   C                            I J F C
   B..C   = ^B C                C
   B...C  = B ^F C              G H D E B C
   B^-    = B^..B
          = ^B^1 B              E I J F B
   C^@    = C^1
          = F                   I J F
   B^@    = B^1 B^2 B^3
          = D E F               D G H E F I J
   C^!    = C ^C^@
          = C ^C^1
          = C ^F                C
   B^!    = B ^B^@
          = B ^B^1 ^B^2 ^B^3
          = B ^D ^E ^F          B
   F^! D  = F ^I ^J D           G H D F
</pre>
</blockquote>
</div>
</div>
<div id="outline-container-headline-18" class="outline-2">
<h2 id="headline-18">
PARSEOPT
</h2>
<div id="outline-text-headline-18" class="outline-text-2">
<p>In <strong>–parseopt</strong> mode, <em>git rev-parse</em> helps massaging options to bring
to shell scripts the same facilities C builtins have. It works as an
option normalizer (e.g. splits single switches aggregate values), a bit
like <strong>getopt(1)</strong> does.</p>
<p>
It takes on the standard input the specification of the options to parse
and understand, and echoes on the standard output a string suitable for
<strong>sh(1)</strong> <strong>eval</strong> to replace the arguments with normalized ones. In case of
error, it outputs usage on the standard error stream, and exits with
code 129.</p>
<p>
Note: Make sure you quote the result when passing it to <strong>eval</strong>. See
below for an example.</p>
