content/man/man1/git-rev-parse.1.org
** Input Format
/git rev-parse --parseopt/ input format is fully text based. It has two
parts, separated by a line that contains only *--*. The lines before the
separator (should be one or more) are used for the usage. The lines
after the separator describe the options.

Each line of options has this format:

#+begin_quote
#+begin_example
<opt-spec><flags>*<arg-hint>? SP+ help LF
#+end_example

#+end_quote

*<opt-spec>*

#+begin_quote
its format is the short option character, then the long option name
separated by a comma. Both parts are not required, though at least one
is necessary. May not contain any of the *<flags>* characters. *h,help*,
*dry-run* and *f* are examples of correct *<opt-spec>*.

#+end_quote

*<flags>*

#+begin_quote
*<flags>* are of ***, *=*, *?* or *!*.

#+begin_quote
·

Use *=* if the option takes an argument.

#+end_quote

#+begin_quote
·

Use *?* to mean that the option takes an optional argument. You probably
want to use the *--stuck-long* mode to be able to unambiguously parse
the optional argument.

#+end_quote

#+begin_quote
·

Use *** to mean that this option should not be listed in the usage
generated for the *-h* argument. It's shown for *--help-all* as
documented in *gitcli*(7).

#+end_quote

#+begin_quote
·

Use *!* to not make the corresponding negated long option available.

#+end_quote

#+end_quote

*<arg-hint>*

#+begin_quote
*<arg-hint>*, if specified, is used as a name of the argument in the
help output, for options that take arguments. *<arg-hint>* is terminated
by the first whitespace. It is customary to use a dash to separate words
in a multi-word argument hint.

#+end_quote

The remainder of the line, after stripping the spaces, is used as the
help associated with the option.

Blank lines are ignored, and lines that don't match this specification
are used as option group headers (start the line with a space to create
such lines on purpose).

** Example

#+begin_quote
#+begin_example
OPTS_SPEC="\
some-command [<options>] <args>...

some-command does foo and bar!
--
h,help!   show the help

foo       some nifty option --foo
bar=      some cool option --bar with an argument
baz=arg   another cool option --baz with a named argument
qux?path  qux may take a path argument but has meaning by itself

  An option group Header
C?        option C with an optional argument"

eval "$(echo "$OPTS_SPEC" | git rev-parse --parseopt -- "$@" || echo exit $?)"
#+end_example

#+end_quote

** Usage text
When *"$@"* is *-h* or *--help* in the above example, the following
usage text would be shown:

#+begin_quote
#+begin_example
usage: some-command [<options>] <args>...

    some-command does foo and bar!

    -h, --help            show the help
    --[no-]foo            some nifty option --foo
    --[no-]bar ...        some cool option --bar with an argument
    --[no-]baz <arg>      another cool option --baz with a named argument
    --[no-]qux[=<path>]   qux may take a path argument but has meaning by itself

An option group Header
    -C[...]               option C with an optional argument
#+end_example

#+end_quote

* SQ-QUOTE
In *--sq-quote* mode, /git rev-parse/ echoes on the standard output a
single line suitable for *sh(1)* *eval*. This line is made by
normalizing the arguments following *--sq-quote*. Nothing other than
quoting the arguments is done.

If you want command input to still be interpreted as usual by /git
rev-parse/ before the output is shell quoted, see the *--sq* option.

** Example

#+begin_quote
#+begin_example
$ cat >your-git-script.sh <<\EOF
#!/bin/sh
args=$(git rev-parse --sq-quote "$@")   # quote user-supplied arguments
command="git frotz -n24 $args"          # and use it inside a handcrafted
                                        # command line
eval "$command"
EOF

$ sh your-git-script.sh "a bc"
#+end_example

#+end_quote

* EXAMPLES

#+begin_quote
·

Print the object name of the current commit:

#+begin_quote
#+begin_example
$ git rev-parse --verify HEAD
#+end_example

#+end_quote

#+end_quote

#+begin_quote
·

Print the commit object name from the revision in the $REV shell
variable:

#+begin_quote
#+begin_example
$ git rev-parse --verify --end-of-options $REV^{commit}
#+end_example

#+end_quote

This will error out if $REV is empty or not a valid revision.

#+end_quote

#+begin_quote
·

Similar to above:

#+begin_quote
#+begin_example
$ git rev-parse --default master --verify --end-of-options $REV
#+end_example

#+end_quote

but if $REV is empty, the commit object name from master will be
printed.

#+end_quote

* GIT
Part of the *git*(1) suite
