public/man/man1/git-rev-parse.1/index.html
<div id="outline-container-headline-19" class="outline-3">
<h3 id="headline-19">
Input Format
</h3>
<div id="outline-text-headline-19" class="outline-text-3">
<p><em>git rev-parse –parseopt</em> input format is fully text based. It has two
parts, separated by a line that contains only <strong>–</strong>. The lines before the
separator (should be one or more) are used for the usage. The lines
after the separator describe the options.</p>
<p>
Each line of options has this format:</p>
<blockquote>
<pre class="example">
&lt;opt-spec&gt;&lt;flags&gt;*&lt;arg-hint&gt;? SP+ help LF
</pre>
</blockquote>
<p>
<strong>&lt;opt-spec&gt;</strong></p>
<blockquote>
<p>its format is the short option character, then the long option name
separated by a comma. Both parts are not required, though at least one
is necessary. May not contain any of the <strong>&lt;flags&gt;</strong> characters. <strong>h,help</strong>,
<strong>dry-run</strong> and <strong>f</strong> are examples of correct <strong>&lt;opt-spec&gt;</strong>.</p>
</blockquote>
<p>
<strong>&lt;flags&gt;</strong></p>
<blockquote>
<p><strong>&lt;flags&gt;</strong> are of <strong>*</strong>, <strong>=</strong>, <strong>?</strong> or <strong>!</strong>.</p>
<blockquote>
<p>·</p>
<p>
Use <strong>=</strong> if the option takes an argument.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
Use <strong>?</strong> to mean that the option takes an optional argument. You probably
want to use the <strong>–stuck-long</strong> mode to be able to unambiguously parse
the optional argument.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
Use <strong>*</strong> to mean that this option should not be listed in the usage
generated for the <strong>-h</strong> argument. It&#39;s shown for <strong>–help-all</strong> as
documented in *gitcli*(7).</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
Use <strong>!</strong> to not make the corresponding negated long option available.</p>
</blockquote>
</blockquote>
<p>
<strong>&lt;arg-hint&gt;</strong></p>
<blockquote>
<p><strong>&lt;arg-hint&gt;</strong>, if specified, is used as a name of the argument in the
help output, for options that take arguments. <strong>&lt;arg-hint&gt;</strong> is terminated
by the first whitespace. It is customary to use a dash to separate words
in a multi-word argument hint.</p>
</blockquote>
<p>
The remainder of the line, after stripping the spaces, is used as the
help associated with the option.</p>
<p>
Blank lines are ignored, and lines that don&#39;t match this specification
are used as option group headers (start the line with a space to create
such lines on purpose).</p>
</div>
</div>
<div id="outline-container-headline-20" class="outline-3">
<h3 id="headline-20">
Example
</h3>
<div id="outline-text-headline-20" class="outline-text-3">
<blockquote>
<pre class="example">
OPTS_SPEC=&#34;\
some-command [&lt;options&gt;] &lt;args&gt;...

some-command does foo and bar!
--
h,help!   show the help

foo       some nifty option --foo
bar=      some cool option --bar with an argument
baz=arg   another cool option --baz with a named argument
qux?path  qux may take a path argument but has meaning by itself

  An option group Header
C?        option C with an optional argument&#34;

eval &#34;$(echo &#34;$OPTS_SPEC&#34; | git rev-parse --parseopt -- &#34;$@&#34; || echo exit $?)&#34;
</pre>
</blockquote>
</div>
</div>
<div id="outline-container-headline-21" class="outline-3">
<h3 id="headline-21">
Usage text
</h3>
<div id="outline-text-headline-21" class="outline-text-3">
<p>When <strong>&#34;$@&#34;</strong> is <strong>-h</strong> or <strong>–help</strong> in the above example, the following
usage text would be shown:</p>
<blockquote>
<pre class="example">
usage: some-command [&lt;options&gt;] &lt;args&gt;...

    some-command does foo and bar!

    -h, --help            show the help
    --[no-]foo            some nifty option --foo
    --[no-]bar ...        some cool option --bar with an argument
    --[no-]baz &lt;arg&gt;      another cool option --baz with a named argument
    --[no-]qux[=&lt;path&gt;]   qux may take a path argument but has meaning by itself

An option group Header
    -C[...]               option C with an optional argument
</pre>
</blockquote>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-22" class="outline-2">
<h2 id="headline-22">
SQ-QUOTE
</h2>
<div id="outline-text-headline-22" class="outline-text-2">
<p>In <strong>–sq-quote</strong> mode, <em>git rev-parse</em> echoes on the standard output a
single line suitable for <strong>sh(1)</strong> <strong>eval</strong>. This line is made by
normalizing the arguments following <strong>–sq-quote</strong>. Nothing other than
quoting the arguments is done.</p>
<p>
If you want command input to still be interpreted as usual by <em>git
rev-parse</em> before the output is shell quoted, see the <strong>–sq</strong> option.</p>
<div id="outline-container-headline-23" class="outline-3">
<h3 id="headline-23">
Example
</h3>
<div id="outline-text-headline-23" class="outline-text-3">
<blockquote>
<pre class="example">
$ cat &gt;your-git-script.sh &lt;&lt;\EOF
#!/bin/sh
args=$(git rev-parse --sq-quote &#34;$@&#34;)   # quote user-supplied arguments
command=&#34;git frotz -n24 $args&#34;          # and use it inside a handcrafted
                                        # command line
eval &#34;$command&#34;
EOF

$ sh your-git-script.sh &#34;a bc&#34;
</pre>
</blockquote>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-24" class="outline-2">
<h2 id="headline-24">
EXAMPLES
</h2>
<div id="outline-text-headline-24" class="outline-text-2">
<blockquote>
<p>·</p>
<p>
Print the object name of the current commit:</p>
<blockquote>
<pre class="example">
$ git rev-parse --verify HEAD
</pre>
</blockquote>
</blockquote>
<blockquote>
<p>·</p>
<p>
Print the commit object name from the revision in the $REV shell
variable:</p>
<blockquote>
<pre class="example">
$ git rev-parse --verify --end-of-options $REV^{commit}
</pre>
</blockquote>
<p>
This will error out if $REV is empty or not a valid revision.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
Similar to above:</p>
<blockquote>
<pre class="example">
$ git rev-parse --default master --verify --end-of-options $REV
</pre>
</blockquote>
<p>
but if $REV is empty, the commit object name from master will be
printed.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-25" class="outline-2">
<h2 id="headline-25">
GIT
</h2>
<div id="outline-text-headline-25" class="outline-text-2">
<p>Part of the *git*(1) suite</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
